{"pageProps":{"post":{"id":"20200605-spellchecking-in-vim","content":"\nJust until stumbling upon some random video on youtube about spellchecking in Vim, I didn't know such capability even existed in Vim. Turns out that you can, and it can be utilized in markdown files, commit messages and etc. This post is a demonstration of how you can enable and utilize spellchecking in Vim.\n\n## Enabling Spellchecking in Vim\n\n```vim\n:set spell spellang=en_us \" use english dictionary for spellchecking\n```\n\nTo only set it for local buffers, use:\n\n```vim\n:setlocal spell spelllang=en_us\n```\n\nI utilize this primarily in autocmds, like this:\n\n```vim\nautocmd BufRead,BufNewFile *.md setlocal spell spelllang=en_us \" enable spellchecking in markdown files\nautocmd FileType gitcommit setlocal spell spelllang=en_us \" enable spellchecking in git commit files\n```\n\nOnce you have these set up, words that are recognized by the spellchecker will be highlighted according to the highlight groups `SpellBad`, `SpellCap`, `SpellRare`, `SpellLocal`. For further reference, consulting the `:help spell-quickstart` docs will come in handy. In my neovim setup, the words are shown underlined (Not exactly sure where it comes from).\n\n## Utilizing it\n\nOne can get recommendations from the spellchecker from the completion engine. Run `set complete+=kspell`, as in:\n\n```vim\nautocmd FileType gitcommit setlocal spell spelllang=en_us | set complete+=kspell\n```\n\nOne can navigate between recommendations in insert mode using `^N` and `^P`, and spellchecking recommendations will show up among the options.\n\nHere are some commands I found useful:\n\n- `]s` and `[s`: navigate between misspelled words. Former moves forward, the latter backwards.\n- `z=`: see alternatives to the word under the cursor. For example, if I write `file` and run `z=` on it, it will recommend a list of words from the dictionary.\n- `zg`: register a word as correct in the dictionary. The Vim dictionary does not know a lot of words, so it will mark a lot of words as incorrect. One way to solve that issue is to register a word to the dictionary. This command does that.\n- `zw`: just like `zg`, but marks a word as incorrect.\n\nFor more, as always, consult the helpdocs. For spellchecking, `:help spell` is where you should go to.\n","title":"Spellchecking in Vim / Neovim","tags":["vim","neovim","quicknote","en"],"date":"2020-06-05"}},"__N_SSG":true}