{"pageProps":{"posts":[{"id":"20210903-building-a-blog","content":"\n(This post will be in english. I haven't used english properly in a long time, I might as well start using it in posts like this)\n\nIn this post I'll be briefly going through how I built my blog with Next.js and some difficulties that I've faced. This will only be a personal reflection, not a tutorial.\n\nSo one day, I decided to build a personal blog. Nothing fancy but a rather simple blog to put my personal info with posting capability. Yes, you can use a given template, but I personally have this innate avoidance for templates. I wish to have complete control of what I use and build, and thus I decided to use a SSG/SSR framework called Next.js.\n\nAnd so, here are the main tools/packages that I've used to build my blog:\n\n- Next.js\n- Remark / Rehype\n- Material UI React\n- GitHub Pages & Workflow\n  I'll go through each of these to address my thoughts on them.\n\n## Next.js\n\nNext.js is a SSG/SSR framework for React. I haven't done SSG nor SSR ever before. It looked like Next.js and Gatsby both offer SSG functionality, so I had to choose. After a bit of research, I knew that Next.js would suit me better. To me Gatsby looked like a full fledged ecosystem with plugins and all, while Next.js was more like plug-and-play. It seemed like I would not have as much control over the project if I used Gatsby, so I chose Next.js. Of course, I haven't used Gatsby so there's the benefit of the doubt.\n\n## Remark / Rehype\n\nRemark / Rehype are libraries that transform markdown and html. I used these packages to convert them into React components, so that I could upload my posts.\n\nThe overall process of conversion is: `Markdown File - Remark - Rehype - React Component`. The markdown file is parsed with remark, translated to html using rehype, and then to a React component. The ecosystem allows you to plug processors in between. For example, I've used the `rehype-highlight` package that highlights code with `highlight.js` under the hood.\n\nWhat I really liked about this package is that it allows users to use their own components for each html tag from markdown. For now, rounding corners in code blocks remain my only usage for this feature (...) but I'm sure I could do much more.\n\n## Material UI React\n\nThis one's a banger. The Material UI component library provides many useful components that follow the Material UI design. _I like pretty things. I don't like CSS._ This library is for me. The familiarity helps as well. Most (if not all) google products use this guideline. The documentation is top notch as well. It also allows easy custom styling. This one's a must have.\n\n## GitHub Pages & Workflow\n\nI've used GitHub pages as my blog hosting service. It serves static assets for free. I heard good things about it, but have never used it before. I had some difficulty initially setting it up, only to find out that I haven't changed the branch for github pages.\n\nSince generating static files requires a building process using Next.js, I have also set up GitHub Actions to automatically build as I push.\n\nI hope to keep my blog minimal, but the minimum functionality will grow larger as the need arises. Eventually the stack will grow as well, and maybe I'll do version 2 of this post when it happens.\n","title":"Building a Personal Blog in Next.js","tags":["nextjs","english"],"date":"2021-09-03"},{"id":"20210831-navy-software-developer","content":"\n블하 (블로그 하이라는 뜻)\n\n아무 생각 없이 대학교를 다니다가 보니 시간이 참 빨리 지나갔다. 고등학교 동기들 중에서는 군대가는 친구들을 여럿 보았는데, 입대를 3학년 이후로 생각하고 있던 이유는 많았다.\n\n1. 우리 학교는 다들 군대를 좀 늦게 가는 분위기였어서..\n2. 입대하기 전에 학교에서 최대한 많이 배워보고 싶은 욕구도 좀 있었다. 물론 그래봐야 전공 수업들이긴 했지만 실제로 학점을 굉장히 몰아 들었다. 졸업 이런거 때문이 아니고 맛보고 싶은게 많았다.\n3. 이왕 가는거 개발 쪽으로 갈 수 있으면 좋을 거라 생각했다. 근데 그러려면 2학년은 마쳐야 가능성이 조금이라도 생긴다. 이유는 후술\n\n3번 이유가 가장 컸다. 병특을 고려하지 않은 이유는 내가 대학원을 가게 되면 그 전에 시간을 너무 많이 써야 해서..그리고 난 대학원 갈 생각이 아직은 꽤 있다. 전문연을 고려하지 않은 이유는 해외로 나가고 싶은 개인적인 로망을 실현하는데 걸림돌이 될 것 같아서. 또 그렇다고 대학원이나 유학을 가야겠다는 확신은 들지 않는 상황이었다. 이것저것 가정하고 고민하다보니 머리가 상당히 복잡해져서, `좋은 보직에 선발되면 그냥 가자!`라는 결론을 내렸다.\n\n## 육군 SW 개발병 지원\n\n2학년 때 입대 고민을 할 당시에는 이걸 지원해서 갈 생각이었다. 선발은 1차 서류 + 2차 면접으로 이루어졌었다. 1차 서류는 학년 점수 + 자격증 + 고교 출석률 3개로 이루어져 있었다. 난 모범생이었으니 고교 출석률은 문제 없었고, 학년은 내가 당장 바꿀 수 없었기에 학년 점수도 고정이었다. 마지막 남은 자격증의 경우 10점이 최고 점수였는데, 10점을 주는 자격증들(기사급)이 여러개 있었고, 그 다음이 8점(산업기사급), 마지막이 6점이었다. 난 자격증은 없는 상황이었어서 주변 사람들이 많이 따는 정보처리 자격증을 취득하기로 했는데, 10점을 주는 정보처리기사 자격증은 졸업을 해야 딸 수 있고, 8점을 주는 정보처리산업기사 자격증은 3학년이 돼야 딸 수 있었다. 6점 주는 기능사 자격증은 초등학생도 딸 수 있던 것 같던데 이걸로는 부족할 것 같았다. 그래서 3학년 된 직후에 정보처리산업기사 자격증 딴다고 필기시험은 회사 다니면서 밤에 공부하고, 실기시험은 수요일에 중간고사 끝나고 수목금 공부해서 가고..참 바쁜 시간 쪼개가며 공부했는데 어쩌다 취득은 했다.\n\n아무튼 내가 당시에 낼 수 있는 최대 점수를 냈는데 1차에서 탈락해버렸다. 모집 인원은 3명, 1차 통과는 3배수였고, 내 점수는 커트보다 3점 낮아서 떨어졌다. 내 점수는 선발 순위가 27위였다. 그만큼 1점이 중요했던 것 같다. 근데 한창 학기 중이라 바쁜 시기였던 것도 있었고, 나는 나름 최선을 다했어서 별로 후회되거나 아쉬운 점은 없었다. 누굴 탓하랴!\n\n## 해군 SW 개발병 지원\n\n육군을 떨어지고 바로 해군을 넣었다. 해군도 1차 서류 - 2차 면접 방식으로 선발을 하는데 1차는 모두 통과시키고 면접을 보는 방식이었다. 배점은 자격(30) + 경력(30) + 전공(40) + 면접(100)이었는데 솔직히 모르고 그냥 면접보러 갔었다. 면접은 대면으로 모든 대상자들이 계룡대에서 보았다. 나는 학교에 있었는데 가까이 있어서 택시타고 갔다. 근데 **면접을 보는 건물이 지도에 안 나오니 잘 찾아가야 한다...**, 택시에서 생각없이 내리고 길도 모르고 걸어가다 늦을 뻔했는데 은인이 나타나서 면접장까지 태워주셨다. 진짜 감사합니다...이걸 보시게 되면 연락해주세요. 보상이라도 해드리고 싶습니다.\n\n선발은 1명 선발이라 적혀 있었고, 병무청 웹사이트에서 조회했을 때는 나의 1차 점수는 3위, 최종 점수가 1위였다. 총 13~15명 정도 지원했던 것으로 기억한다. 다만 지원할 때 1명보다 많이 뽑을 수도 있다고 적혀 있어 실제로 얼마나 뽑았는지는 모르겠다. 내가 2등이었는데 뽑혔으면 여러 명 뽑았구나 할텐데 그렇지 않으니..\n\n### 면접 후기\n\n_다음 문단은 면접 내용을 다룹니다. 문제가 된다면 삭제하겠습니다._\n\n나에게 물어보신 질문들을 직접 적을 생각은 없다. 대신 어떤 느낌으로 나왔는지 설명하겠다.\n\n#### 자료를 성심성의껏 준비하자\n\n나는 이 자료로부터 나오는 질문이 많았다. 고정질문이랑 비슷한 수의 질문을 하신 것 같다. 그만큼 주의깊게 이 자료를 보시니 준비를 잘하자!\n\n매수 또한 넉넉하게 출력해가는 것이 좋다. 나는 평소에 정말 생각이 없는 편이라 한 장만 뽑았었는데 운이 좋게도 여러 개 뽑을 생각을 했었다. 면접 보러 들어가니 면접관이 한 분보다 많이 계셔서 다행이 한 부씩 드릴 수 있었다.\n\n우선 1차를 통과하고(2021년도 기준 100%) 포트폴리오나 자기소개서 등의 자료를 자유롭게고 지참하라는 연락을 받았다. 근데 나는 둘 다 없는 상황이었다. 사실 반년 전에 회사 인턴 지원하면서 작성한 게 있긴 했는데 정말 편한 느낌으로 써놓은 거라 그대로 내기에는 부담스러웠다. 그래서 처음부터 다시 작성했다. 어떤 내용을 넣을지는 고민을 많이 한 부분이다. 나는 `짧은 소개 + 경력 + 프로젝트 경험 + 보유기술 + 어학능력 + 교육 + 기타 활동`으로 구성했다. 그냥 내 마음대로 만든 구성이다. _Mimic at your own risk!_\n\n포트폴리오라는 말을 몰라 취업한 형에게 물어보니 보통 피피티 형태라고 하던데, 어떻게 가져오라는 건지 약간 의문이어서 그냥 문서 형식으로 작성해갔었다. 가보고 나니 그렇게 준비해가길 잘했다. 나의 경우 가서 디지털로 발표를 할 환경은 아니었다. 물론 둘 다 준비를 하면 최고겠다. 나는 시간에 쫓겨 준비했었기 때문에...\n\n#### 기본적인 조사는 하자\n\n군면접의 성격을 띤 질문들도 많이 하신다. 대한민국 군대와 역사에 대해 최소한으로는 알아가면 좋을 것 같다. 나는 해군에 지원했기에 해군과 관련된 지식을 좀 쌓고 가는 것도 좋을 것이다.\n이외에도 부대 내에서의 상황을 주시고 이런 상황에서 어떻게 행동할 것인지에 관한 질문들 또한 하신다. 여러 가지 상황을 준비해가는 것도 방법일 것 같다. 나는 약간 생소한 상황을 질문하셔서 내 평소 가치관이랑 순발력에 의지해서 대답을 드려야 했다.\n\n내가 시간이 지나면 위 내용들을 잊을 것 같아 글을 작성하기도 했지만 해군 개발병에 지원할 때 후기가 전혀 없어 준비하기가 조금 어려워서 누군가 이 글을 보고 조금 더 수월하게 준비했으면 하는 마음도 있다. 지금 제 블로그가 바닥부터 만든거라 댓글 기능이 없는데, 추가 문의사항이 생기면 메일로 문의를 주시거나 보실 적에 댓글 기능이 있으면 댓글 달아주세요:)\n","title":"해군 SW 개발병 지원 후기","tags":["general","diary","military"],"date":"2021-08-31"},{"id":"20210829-genesis","content":"\n## Hello World!\n\n블로그를 시작하게 되었다.\n\n블로그 운영은 거의 올해 초부터 해보고 싶었는데, 본업 때문에 시간이 부족하다는 변명을 스스로에게 하며 시작하지 않고 있었다... 나는 \"From Scratch\"를 굉장히 좋아하는 편이라 블로그도 템플릿에 의존하지 않고 직접 만들어야 한다는 생각 때문에 시작하는데 조금 장벽이 되었을 수도 있었을 것 같다는 생각이 든다.\n\n21년 여름에는 본교 PLRG에서 개별연구를 했는데, 랩 미팅 때 교수님께서 \"평소에 글을 쓰는 습관을 들이는 것이 좋다\"라는 말씀을 하신 것을 듣고 조금 더 동기부여가 되었던 것 같다. 얼마 뒤인지부터는 모르겠는데 아무튼 블로그 개발을 시작했고, 소개, bio, 그리고 게시글 조회 기능을 만든 뒤에 이 글을 작성하고 있다.\n\n동기부여가 되었던 또 다른 일은 입대가 얼마 안 남았다는 점이다. 이 이야기는 별도의 글에 더 자세하게 담겠지만, 불과 이틀 전에 해군 SW 개발병에 합격했는데, 한 명 뽑는 보직이다 보니 될 기대를 크게 안하고 있었어서 입영 날짜를 모르고 있었다. 알고 보니 10월 5일 입영이었고 백신 문제 때문에 정확히 그때 갈지는 모르겠지만 시간이 한 달...정도밖에 남지 않았기 때문에, 시간이 있을 때라도 좀 정리를 하고 가야겠다는 생각을 했다. 물론 아직 남은 시간동안 어떠한 일을 할지 제대로 생각을 못해봤는데, 최대한 블로그 정리를 하고 갈 수 있었으면 한다.\n\n블로그 게시글들은 남이 볼 것이라고 기대하지는 않고 오히려 개인 일기 느낌에 가깝도록 편하게 적을 것 같은데, 또 나만 알아들을 수 있도록 적지는 않을 생각이다. 주 내용은 내가 평소에 관심있던 편집기 이야기 및 개발을 배우면서 사소하게 배웠던 것들을 적을 것 같다! 또 예전부터 개인 노션이나 `vimwiki` 등 여기저기 적어는 놓았는데 정리가 안된 자료들도 과거 작성 날짜에 맞춰 업로드할 생각이다.\n","title":"블로그 개업!","tags":["general","diary"],"date":"2021-08-29"}]},"__N_SSG":true}